Revit 2024 API
StructuralSectionStructuralTees.BoltSpacingWeb Property
 Standard bolt spacing in the web, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltSpacingWeb { get; set; }
Visual Basic
Public Property BoltSpacingWeb As Double
	Get
	Set
Visual C++
public:
property double BoltSpacingWeb {
	double get ();
	void set (double value);
}
See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace